n = int(input("Введите число = "))
p = 1.0

for n in range(1, n+1):
    p *= 1 + 1 / (n*n)
print(f"Сумма = {p:.5f}")

# Дано натуральное число n. Вычислить произведение P = (1+1/1^2) * (1+1/2^2) * ... * (1+1/n^2)
