# Вариант 12
# Манастырский А.С.
# Задача 1.2.1

p, k, t = map(float,input('Введите(через пробел) 3 числа (p, k, t) = ').split())
print(f"H = {(p + k) ** 2 / p * k ** 0.5 / (k - p) / t ** 2:.3f}")

# H = (p + k) ** 2 / p * k ** 0.5 / (k - p) / t ** 2