# Вариант 12
# Манастырский А.С.
# Задача 3.2

n = int(input('Введите целое число = '))
if n > 0:
    print(f"N = {n ** 0.5:.3f}")
else:
    print(f"N = {n * 3:.3f}")
    
# Дано целое число. Если оно положительное, извлечь из него корень, в
# противном случае умножить на 3